var News = [
    { id: 1, img: '11.jpg', detail: 'สำนักงานคณะกรรมการกำกับและส่งเสริมการประกอบธุรกิจประกันภัย ประชาสัมพันธ์และให้ความรู้ ', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 2, img: '12.jpg', detail: 'วันที่ 12 กรกฎาคม 2567 โรงเรียนอำนาจเจริญ ร่วมกับ มลฑลทหารบกที่ 22', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 3, img: '13.jpg', detail: 'นักเรียนห้องเรียนพิเศษคอมพิวเตอร์ ICTP ANC ได้เข้าร่วมกิจกรรมในโครงการ Coding for Better Life', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 4, img: '14.jpg', detail: 'โรงเรียนอำนาจเจริญ นำนักเรียนร่วมแสดง เพื่อเป็นตัวเเทนจังหวัดในการประกวดการเเสดงบนเวที', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 5, img: '15.jpg', detail: 'โรงเรียนอำนาจเจริญได้เปิดรับสมัครนักเรียนชั้นมัธยมศึกษาปีที่ 4 ในปีการศึกษา 2567', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 6, img: '16.jpg', detail: 'ขอแสดงความยินดีให้กับนักเรียนที่ทำความดี', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 7, img: '17.jpg', detail: 'ขอแสดงความยินดีให้กับนักเรียนโรงเรียนอำนาจเจริญที่ผ่านการเข้ารอบ ค่ายสอวน. ค่าย 1', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 8, img: '18.jpg', detail: 'วันพระใหญ่ทางโรงเรียนอำนาจเจริญได้นำนักเรียนและคณะครูอาจารย์ เข้าร่วมรำถวายพระมงคลมิ่งเมือง', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' },
    { id: 9, img: '19.jpg', detail: 'โรงเรียนอำนาจเจริญ ได้จัดกิจกรรมเครื่องแบบ เข้าค่ายลูกเสือ เนตรนารี และยุวกาชาด', date: '11 กรกฎาคม 2567 เวลา 08.50 น.' }
];

var fulldetail = [
    {
        newsdetail:'วันที่ 11 กรกฏาคม 2567 สำนักงานคณะกรรมการกำกับและส่งเสริมการประกอบธุรกิจประกันภัย ประชาสัมพันธ์และให้ความรู้ สืบเนื่องจากโครงการอัจฉริยะยุวชนประกันภัย ประจำปี 2567 ณ กิจกรรมหน้าเสาธง โรงเรียนอำนาจเจริญ'
    },
    {
        newsdetail:'วันที่ 12 กรกฎาคม 2567 โรงเรียนอำนาจเจริญ ร่วมกับ มลฑลทหารบกที่ 22 เป็นตัวแทนจังหวัดอำนาจเจริญ เข้าร่วมการแข่งขันประกวดดนตรีสากลร่วมสมัย คีตวัฒนศิลป์ บรรเลงเพลงไทยเพื่อแผ่นดิน ปีที่ 3 ประจำปี 2567 โดยมี นายสุกิจ จันทบาล ผู้อำนวยการโรงเรียนอำนาจเจริญ เป็นประธานในพิธีเปิดการแข่งขัน ภายใต้แนวคิด ปลูกกล้า บรรเลงรักษ์ แด่องค์ราชัน ณ หอประชุมศรีอำนาจเจริญ'
    },
    {
        newsdetail:'นักเรียนห้องเรียนพิเศษคอมพิวเตอร์ ICTP ANC  ได้เข้าร่วมกิจกรรมในโครงการ Coding for Better Life สร้างรากฐานอนาคตประเทศไทย11 กรกฎาคม 2567, จังหวัดอุบลราชธานี - สำนักงานส่งเสริมเศรษฐกิจดิจิทัล (ดีป้า) จัดกิจกรรม Coding Bootcamp & Roadshow และ Coding War พื้นที่ภาคอีสานตอนล่าง ภายใต้โครงการ Coding for Better Life สร้างรากฐานอนาคตประเทศไทย หลังกิจกรรมในพื้นที่ภาคอีสานตอนกลางและภาคกลางได้รับกระแสตอบรับดีเยี่ยม รุกติวเข้มทักษะโค้ดดิ้งนักเรียน – ครู สร้างความตระหนักรู้ประชาชน เรียนรู้ทักษะโค้ดดิ้ง และอัปเดตเทรนด์เทคโนโลยี นวัตกรรม และ AI พร้อมเปิดพื้นที่ให้เด็กไทยแข่งขันทักษะด้านโค้ดดิ้งเพื่อเข้าร่วมแข่งขัน Coding War รอบ Final  ที่กรุงเทพฯ ระหว่างวันที่ 13 - 15 กันยายนนี้ ชี้โครงการดังกล่าวจะช่วยสร้างกำลังคนดิจิทัลที่มีศักยภาพรองรับ ความต้องการของภาคอุตสาหกรรม และแก้ไขปัญหาการขาดแคลนกำลังคนดิจิทัลของประเทศได้อย่างยั่งยืนทีม ICTP ANC นายทสพร เสมอดี    ชั้นม. 5/6นางสาวธัญชนก ภูมิกาล ชั้นม. 5/6นางสาวอักษราภัค สหารัตน์ ชั้นม.4/6ฝึกสอนและควบคุมทีมโดย ครูอารีรัตน์ ธานี อำนวยการโดย นายสุกิจ  จันทบาล  ผู้อำนวยการโรงเรียนอำนาจเจริญ ได้รับรางวัลรองชนะเลิศอันดับ 3 และได้ร่วมเป็นตัวแทน ภาคอีสานตอนล่างเข้าร่วมแข่งขัน รอบไฟนอล ต่อไป'
    },
    {
        newsdetail:'โรงเรียนอำนาจเจริญ นำนักเรียนร่วมแสดง เพื่อเป็นตัวเเทนจังหวัดในการประกวดการเเสดงบนเวที ประเภทจังหวัด TO BE NUMBER ONE ระดับประเทศ ประจำปี 2567 ระหว่างวันที่ 12-16 กรกฎาคม 2567 ณ ศูนย์การประชุมอิมแพ็ค ฟอรั่ม เมืองทองธานี จังหวัดนนทบุรี ฝึกซ้อมและควบคุมการแสดงโดย คุณครูปฎิมาพร พูลศิริ และคุณครูโสริยา พูลศิริ'
    },
    {
        newsdetail:'โรงเรียนอำนาจเจริญได้เปิดรับสมัครนักเรียนชั้นมัธยมศึกษาปีที่ 4 ในปีการศึกษา 2567 แต่ฉันต้องอธิบายให้คุณฟังว่าความคิดที่ผิดพลาดเกี่ยวกับการประณามความสุขและการยกย่องความเจ็บปวดนี้เกิดขึ้นได้อย่างไร และฉันจะให้เรื่องราวทั้งหมดเกี่ยวกับระบบแก่คุณ และอธิบายคำสอนที่แท้จริงของนักสำรวจผู้ยิ่งใหญ่แห่งความจริง ผู้เป็นผู้สร้างความสุขของมนุษย์ ไม่มีใครปฏิเสธ ไม่ชอบ หรือหลีกเลี่ยงความสุขด้วยตนเอง เพราะมันคือความสุข แต่เพราะว่าผู้ที่ไม่รู้จักการแสวงหาความสุขอย่างมีเหตุมีผล ย่อมประสบผลที่เจ็บปวดอย่างยิ่ง และไม่มีใครรักหรือรักใคร่ แสวงหาหรือปรารถนาที่จะได้รับความเจ็บปวดของตัวเองเพราะมันเป็นความเจ็บปวด แต่บางครั้งสถานการณ์ที่เกิดขึ้นซึ่งความเหน็ดเหนื่อยและความเจ็บปวดสามารถทำให้เขาได้รับความยินดีอย่างยิ่ง ยกตัวอย่างเล็ก ๆ น้อย ๆ ซึ่งพวกเราเคยออกกำลังกายอย่างหนักยกเว้นเพื่อให้ได้ประโยชน์บางอย่าง จากมัน ใครมีสิทธิที่จะจับผิดกับคนที่เลือกเพลิดเพลินกับความสุขที่ไม่มีผลที่น่ารำคาญหรือผู้ที่หลีกเลี่ยงความเจ็บปวดที่ไม่ก่อให้เกิดความสุข? ในทางกลับกัน เราประณามด้วยความขุ่นเคืองอันชอบธรรมและไม่ชอบผู้ชายที่ถูกล่อลวงและขวัญเสียด้วยมนต์เสน่ห์แห่งความสุขในขณะนั้น มืดบอดด้วยความปรารถนา จนไม่อาจล่วงรู้ถึงความเจ็บปวดและปัญหาที่จะตามมาได้ และการตำหนิที่เท่าเทียมกันเป็นของบรรดาผู้ล้มเหลวในหน้าที่เพราะความอ่อนแอของเจตจำนง ซึ่งก็เหมือนกับการพูดด้วยการหดตัวจากงานหนักและความเจ็บปวด กรณีเหล่านี้เรียบง่ายอย่างสมบูรณ์และแยกแยะได้ง่าย ในชั่วโมงว่างๆ เมื่อพลังแห่งการเลือกของเราไม่ถูกแทรกแซงและเมื่อไม่มีอะไรมาขวางการทำในสิ่งที่เราชอบได้ดีที่สุด ความสุขทุกอย่างก็ได้รับการต้อนรับและหลีกเลี่ยงความเจ็บปวดทุกอย่าง แต่ในบางสถานการณ์และเนื่องจากการเรียกร้องของหน้าที่หรือภาระผูกพันของธุรกิจมักจะเกิดขึ้นที่ความสุขจะต้องถูกปฏิเสธและยอมรับความรำคาญ ดังนั้น นักปราชญ์จึงยึดถือหลักการเลือกนี้ในเรื่องนี้เสมอ: เขาปฏิเสธความยินดีเพื่อให้ได้รับความสุขอื่น ๆ ที่ยิ่งใหญ่กว่า มิฉะนั้นเขาอดทนต่อความเจ็บปวดเพื่อหลีกเลี่ยงความเจ็บปวดที่เลวร้ายกว่านั้น.'
    },
    {
        newsdetail:'ขอแสดงความยินดีให้กับนักเรียนที่ทำความดีแต่ฉันต้องอธิบายให้คุณฟังว่าความคิดที่ผิดพลาดเกี่ยวกับการประณามความสุขและการยกย่องความเจ็บปวดนี้เกิดขึ้นได้อย่างไร และฉันจะให้เรื่องราวทั้งหมดเกี่ยวกับระบบแก่คุณ และอธิบายคำสอนที่แท้จริงของนักสำรวจผู้ยิ่งใหญ่แห่งความจริง ผู้เป็นผู้สร้างความสุขของมนุษย์ ไม่มีใครปฏิเสธ ไม่ชอบ หรือหลีกเลี่ยงความสุขด้วยตนเอง เพราะมันคือความสุข แต่เพราะว่าผู้ที่ไม่รู้จักการแสวงหาความสุขอย่างมีเหตุมีผล ย่อมประสบผลที่เจ็บปวดอย่างยิ่ง และไม่มีใครรักหรือรักใคร่ แสวงหาหรือปรารถนาที่จะได้รับความเจ็บปวดของตัวเองเพราะมันเป็นความเจ็บปวด แต่บางครั้งสถานการณ์ที่เกิดขึ้นซึ่งความเหน็ดเหนื่อยและความเจ็บปวดสามารถทำให้เขาได้รับความยินดีอย่างยิ่ง ยกตัวอย่างเล็ก ๆ น้อย ๆ ซึ่งพวกเราเคยออกกำลังกายอย่างหนักยกเว้นเพื่อให้ได้ประโยชน์บางอย่าง จากมัน ใครมีสิทธิที่จะจับผิดกับคนที่เลือกเพลิดเพลินกับความสุขที่ไม่มีผลที่น่ารำคาญหรือผู้ที่หลีกเลี่ยงความเจ็บปวดที่ไม่ก่อให้เกิดความสุข? ในทางกลับกัน เราประณามด้วยความขุ่นเคืองอันชอบธรรมและไม่ชอบผู้ชายที่ถูกล่อลวงและขวัญเสียด้วยมนต์เสน่ห์แห่งความสุขในขณะนั้น มืดบอดด้วยความปรารถนา จนไม่อาจล่วงรู้ถึงความเจ็บปวดและปัญหาที่จะตามมาได้ และการตำหนิที่เท่าเทียมกันเป็นของบรรดาผู้ล้มเหลวในหน้าที่เพราะความอ่อนแอของเจตจำนง ซึ่งก็เหมือนกับการพูดด้วยการหดตัวจากงานหนักและความเจ็บปวด กรณีเหล่านี้เรียบง่ายอย่างสมบูรณ์และแยกแยะได้ง่าย ในชั่วโมงว่างๆ เมื่อพลังแห่งการเลือกของเราไม่ถูกแทรกแซงและเมื่อไม่มีอะไรมาขวางการทำในสิ่งที่เราชอบได้ดีที่สุด ความสุขทุกอย่างก็ได้รับการต้อนรับและหลีกเลี่ยงความเจ็บปวดทุกอย่าง แต่ในบางสถานการณ์และเนื่องจากการเรียกร้องของหน้าที่หรือภาระผูกพันของธุรกิจมักจะเกิดขึ้นที่ความสุขจะต้องถูกปฏิเสธและยอมรับความรำคาญ ดังนั้น นักปราชญ์จึงยึดถือหลักการเลือกนี้ในเรื่องนี้เสมอ: เขาปฏิเสธความยินดีเพื่อให้ได้รับความสุขอื่น ๆ ที่ยิ่งใหญ่กว่า มิฉะนั้นเขาอดทนต่อความเจ็บปวดเพื่อหลีกเลี่ยงความเจ็บปวดที่เลวร้ายกว่านั้น'
    },
    {
        newsdetail:'ขอแสดงความยินดีให้กับนักเรียนโรงเรียนอำนาจเจริญที่ผ่านการเข้ารอบ ค่ายสอวน. ค่าย 1 แต่ฉันต้องอธิบายให้คุณฟังว่าความคิดที่ผิดพลาดเกี่ยวกับการประณามความสุขและการยกย่องความเจ็บปวดนี้เกิดขึ้นได้อย่างไร และฉันจะให้เรื่องราวทั้งหมดเกี่ยวกับระบบแก่คุณ และอธิบายคำสอนที่แท้จริงของนักสำรวจผู้ยิ่งใหญ่แห่งความจริง ผู้เป็นผู้สร้างความสุขของมนุษย์ ไม่มีใครปฏิเสธ ไม่ชอบ หรือหลีกเลี่ยงความสุขด้วยตนเอง เพราะมันคือความสุข แต่เพราะว่าผู้ที่ไม่รู้จักการแสวงหาความสุขอย่างมีเหตุมีผล ย่อมประสบผลที่เจ็บปวดอย่างยิ่ง และไม่มีใครรักหรือรักใคร่ แสวงหาหรือปรารถนาที่จะได้รับความเจ็บปวดของตัวเองเพราะมันเป็นความเจ็บปวด แต่บางครั้งสถานการณ์ที่เกิดขึ้นซึ่งความเหน็ดเหนื่อยและความเจ็บปวดสามารถทำให้เขาได้รับความยินดีอย่างยิ่ง ยกตัวอย่างเล็ก ๆ น้อย ๆ ซึ่งพวกเราเคยออกกำลังกายอย่างหนักยกเว้นเพื่อให้ได้ประโยชน์บางอย่าง จากมัน ใครมีสิทธิที่จะจับผิดกับคนที่เลือกเพลิดเพลินกับความสุขที่ไม่มีผลที่น่ารำคาญหรือผู้ที่หลีกเลี่ยงความเจ็บปวดที่ไม่ก่อให้เกิดความสุข? ในทางกลับกัน เราประณามด้วยความขุ่นเคืองอันชอบธรรมและไม่ชอบผู้ชายที่ถูกล่อลวงและขวัญเสียด้วยมนต์เสน่ห์แห่งความสุขในขณะนั้น มืดบอดด้วยความปรารถนา จนไม่อาจล่วงรู้ถึงความเจ็บปวดและปัญหาที่จะตามมาได้ และการตำหนิที่เท่าเทียมกันเป็นของบรรดาผู้ล้มเหลวในหน้าที่เพราะความอ่อนแอของเจตจำนง ซึ่งก็เหมือนกับการพูดด้วยการหดตัวจากงานหนักและความเจ็บปวด กรณีเหล่านี้เรียบง่ายอย่างสมบูรณ์และแยกแยะได้ง่าย ในชั่วโมงว่างๆ เมื่อพลังแห่งการเลือกของเราไม่ถูกแทรกแซงและเมื่อไม่มีอะไรมาขวางการทำในสิ่งที่เราชอบได้ดีที่สุด ความสุขทุกอย่างก็ได้รับการต้อนรับและหลีกเลี่ยงความเจ็บปวดทุกอย่าง แต่ในบางสถานการณ์และเนื่องจากการเรียกร้องของหน้าที่หรือภาระผูกพันของธุรกิจมักจะเกิดขึ้นที่ความสุขจะต้องถูกปฏิเสธและยอมรับความรำคาญ ดังนั้น นักปราชญ์จึงยึดถือหลักการเลือกนี้ในเรื่องนี้เสมอ: เขาปฏิเสธความยินดีเพื่อให้ได้รับความสุขอื่น ๆ ที่ยิ่งใหญ่กว่า มิฉะนั้นเขาอดทนต่อความเจ็บปวดเพื่อหลีกเลี่ยงความเจ็บปวดที่เลวร้ายกว่านั้น'
    },
    {
        newsdetail:'วันพระใหญ่ทางโรงเรียนอำนาจเจริญได้นำนักเรียนและคณะครูอาจารย์ เข้าร่วมรำถวายพระมงคลมิ่งเมือง แต่ฉันต้องอธิบายให้คุณฟังว่าความคิดที่ผิดพลาดเกี่ยวกับการประณามความสุขและการยกย่องความเจ็บปวดนี้เกิดขึ้นได้อย่างไร และฉันจะให้เรื่องราวทั้งหมดเกี่ยวกับระบบแก่คุณ และอธิบายคำสอนที่แท้จริงของนักสำรวจผู้ยิ่งใหญ่แห่งความจริง ผู้เป็นผู้สร้างความสุขของมนุษย์ ไม่มีใครปฏิเสธ ไม่ชอบ หรือหลีกเลี่ยงความสุขด้วยตนเอง เพราะมันคือความสุข แต่เพราะว่าผู้ที่ไม่รู้จักการแสวงหาความสุขอย่างมีเหตุมีผล ย่อมประสบผลที่เจ็บปวดอย่างยิ่ง และไม่มีใครรักหรือรักใคร่ แสวงหาหรือปรารถนาที่จะได้รับความเจ็บปวดของตัวเองเพราะมันเป็นความเจ็บปวด แต่บางครั้งสถานการณ์ที่เกิดขึ้นซึ่งความเหน็ดเหนื่อยและความเจ็บปวดสามารถทำให้เขาได้รับความยินดีอย่างยิ่ง ยกตัวอย่างเล็ก ๆ น้อย ๆ ซึ่งพวกเราเคยออกกำลังกายอย่างหนักยกเว้นเพื่อให้ได้ประโยชน์บางอย่าง จากมัน ใครมีสิทธิที่จะจับผิดกับคนที่เลือกเพลิดเพลินกับความสุขที่ไม่มีผลที่น่ารำคาญหรือผู้ที่หลีกเลี่ยงความเจ็บปวดที่ไม่ก่อให้เกิดความสุข? ในทางกลับกัน เราประณามด้วยความขุ่นเคืองอันชอบธรรมและไม่ชอบผู้ชายที่ถูกล่อลวงและขวัญเสียด้วยมนต์เสน่ห์แห่งความสุขในขณะนั้น มืดบอดด้วยความปรารถนา จนไม่อาจล่วงรู้ถึงความเจ็บปวดและปัญหาที่จะตามมาได้ และการตำหนิที่เท่าเทียมกันเป็นของบรรดาผู้ล้มเหลวในหน้าที่เพราะความอ่อนแอของเจตจำนง ซึ่งก็เหมือนกับการพูดด้วยการหดตัวจากงานหนักและความเจ็บปวด กรณีเหล่านี้เรียบง่ายอย่างสมบูรณ์และแยกแยะได้ง่าย ในชั่วโมงว่างๆ เมื่อพลังแห่งการเลือกของเราไม่ถูกแทรกแซงและเมื่อไม่มีอะไรมาขวางการทำในสิ่งที่เราชอบได้ดีที่สุด ความสุขทุกอย่างก็ได้รับการต้อนรับและหลีกเลี่ยงความเจ็บปวดทุกอย่าง แต่ในบางสถานการณ์และเนื่องจากการเรียกร้องของหน้าที่หรือภาระผูกพันของธุรกิจมักจะเกิดขึ้นที่ความสุขจะต้องถูกปฏิเสธและยอมรับความรำคาญ ดังนั้น นักปราชญ์จึงยึดถือหลักการเลือกนี้ในเรื่องนี้เสมอ: เขาปฏิเสธความยินดีเพื่อให้ได้รับความสุขอื่น ๆ ที่ยิ่งใหญ่กว่า มิฉะนั้นเขาอดทนต่อความเจ็บปวดเพื่อหลีกเลี่ยงความเจ็บปวดที่เลวร้ายกว่านั้น'
    },
    {
        newsdetail:'โรงเรียนอำนาจเจริญ ได้จัดกิจกรรมเครื่องแบบ เข้าค่ายลูกเสือ เนตรนารี และยุวกาชาด แต่ฉันต้องอธิบายให้คุณฟังว่าความคิดที่ผิดพลาดเกี่ยวกับการประณามความสุขและการยกย่องความเจ็บปวดนี้เกิดขึ้นได้อย่างไร และฉันจะให้เรื่องราวทั้งหมดเกี่ยวกับระบบแก่คุณ และอธิบายคำสอนที่แท้จริงของนักสำรวจผู้ยิ่งใหญ่แห่งความจริง ผู้เป็นผู้สร้างความสุขของมนุษย์ ไม่มีใครปฏิเสธ ไม่ชอบ หรือหลีกเลี่ยงความสุขด้วยตนเอง เพราะมันคือความสุข แต่เพราะว่าผู้ที่ไม่รู้จักการแสวงหาความสุขอย่างมีเหตุมีผล ย่อมประสบผลที่เจ็บปวดอย่างยิ่ง และไม่มีใครรักหรือรักใคร่ แสวงหาหรือปรารถนาที่จะได้รับความเจ็บปวดของตัวเองเพราะมันเป็นความเจ็บปวด แต่บางครั้งสถานการณ์ที่เกิดขึ้นซึ่งความเหน็ดเหนื่อยและความเจ็บปวดสามารถทำให้เขาได้รับความยินดีอย่างยิ่ง ยกตัวอย่างเล็ก ๆ น้อย ๆ ซึ่งพวกเราเคยออกกำลังกายอย่างหนักยกเว้นเพื่อให้ได้ประโยชน์บางอย่าง จากมัน ใครมีสิทธิที่จะจับผิดกับคนที่เลือกเพลิดเพลินกับความสุขที่ไม่มีผลที่น่ารำคาญหรือผู้ที่หลีกเลี่ยงความเจ็บปวดที่ไม่ก่อให้เกิดความสุข? ในทางกลับกัน เราประณามด้วยความขุ่นเคืองอันชอบธรรมและไม่ชอบผู้ชายที่ถูกล่อลวงและขวัญเสียด้วยมนต์เสน่ห์แห่งความสุขในขณะนั้น มืดบอดด้วยความปรารถนา จนไม่อาจล่วงรู้ถึงความเจ็บปวดและปัญหาที่จะตามมาได้ และการตำหนิที่เท่าเทียมกันเป็นของบรรดาผู้ล้มเหลวในหน้าที่เพราะความอ่อนแอของเจตจำนง ซึ่งก็เหมือนกับการพูดด้วยการหดตัวจากงานหนักและความเจ็บปวด กรณีเหล่านี้เรียบง่ายอย่างสมบูรณ์และแยกแยะได้ง่าย ในชั่วโมงว่างๆ เมื่อพลังแห่งการเลือกของเราไม่ถูกแทรกแซงและเมื่อไม่มีอะไรมาขวางการทำในสิ่งที่เราชอบได้ดีที่สุด ความสุขทุกอย่างก็ได้รับการต้อนรับและหลีกเลี่ยงความเจ็บปวดทุกอย่าง แต่ในบางสถานการณ์และเนื่องจากการเรียกร้องของหน้าที่หรือภาระผูกพันของธุรกิจมักจะเกิดขึ้นที่ความสุขจะต้องถูกปฏิเสธและยอมรับความรำคาญ ดังนั้น นักปราชญ์จึงยึดถือหลักการเลือกนี้ในเรื่องนี้เสมอ: เขาปฏิเสธความยินดีเพื่อให้ได้รับความสุขอื่น ๆ ที่ยิ่งใหญ่กว่า มิฉะนั้นเขาอดทนต่อความเจ็บปวดเพื่อหลีกเลี่ยงความเจ็บปวดที่เลวร้ายกว่านั้น'
    },
]


$(document).ready(() => {
    var html = '';
    for (let i = 0; i < News.length; i++) {
        html += `<div class="content" onclick="openNewsDetail(${i})">
                    <img class="img-set" src="${News[i].img}" alt="News Image">
                    <p>${News[i].detail}</p>
                </div>`;
    }
    $("#newslist").html(html);
    $(".modal-bg").on("click", function() {
        closeModal();
    });
});

$(document).ready(() => {
    var html = '';
    for (let i = 0; i < News.length; i++) {
        html += `<div class="content" onclick="openNewsDetail(${i})">
                    <img class="img-set" src="${News[i].img}" alt="News Image">
                    <p>${News[i].detail}</p>
                </div>`;
    }
    $("#newslist-all").html(html);
    $(".modal-bg").on("click", function() {
        closeModal();
    });
});

var newsindex = 0;
function openNewsDetail(index) {
    newsindex = index;
    console.log(newsindex);
    const newsItem = News[newsindex];
    $(".modal-img").attr("src", newsItem.img);
    $(".modal-detail p").text(fulldetail[newsindex].newsdetail);
    $(".date-news").text(newsItem.date);
    $("#modalDesc").css('display', 'flex');
}

function closeModal() {
    $("#modalDesc").css('display', 'none');
}

function downloadFile(url) {
    const a = document.createElement('a');
    a.href = url;
    a.download = url.split('/').pop();  
    document.body.appendChild(a);
    a.click();
    document.body.removeChild(a);
}


function ToTop() {
    document.body.scrollTop = 0;
    document.documentElement.scrollTop = 0;
}
function ToScience() {
    const element = document.getElementById("science");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}
function ToMath() {
    const element = document.getElementById("math");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}
function ToThai() {
    const element = document.getElementById("thai");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}
function ToPE() {
    const element = document.getElementById("pe");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}
function ToSug() {
    const element = document.getElementById("sug");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}

function ToSocial() {
    const element = document.getElementById("social");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}

function ToEng() {
    const element = document.getElementById("eng");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}

function ToCareer() {
    const element = document.getElementById("career");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}

function ToArt() {
    const element = document.getElementById("art");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}

function ToOther() {
    const element = document.getElementById("other");
    if (element) {
        element.scrollIntoView({ behavior: "smooth" });
    }
}
